rhoReactingFoam/20000_2_1e-9/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2;
        startFace       59998;
    }
    outlet
    {
        type            patch;
        nFaces          2;
        startFace       60000;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20000;
        startFace       60002;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20000;
        startFace       80002;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       100002;
    }
)

// ************************************************************************* //
